> 在数据分析和建模的过程中，相当多的时间要用在数据准备上：加载、清理、转换以及重塑。这些工作会占到分析师时间的 80%或更多。有时，存储在文件和数据库中的数据的格式不适合某个特定的任务。许多研究者都选择使用通用编程语言（如 Python、Perl、R 或 Java）或 UNIX 文本处理工具（如sed或awk）对数据格式进行专门处理。幸运的是，pandas 和内置的 Python 标准库提供了一组高级的、灵活的、快速的工具，可以让你轻松地将数据规整为想要的格式。

# 处理缺失数据

在许多数据分析工作中，缺失数据是经常发生的。pandas 的目标之一就是尽量轻松地处理缺失数据。

对于数值数据，pandas 使用浮点值NaN（Not a Number）表示缺失数据。我们称其为哨兵值，可以方便的检测出来。

在 pandas 中，我们采用了 R 语言中的惯用法，即将缺失值表示为 NA，它表示不可用（not available）。

Python 内置的None值在对象数组中也可以作为 NA。

In [1]:
import numpy as np
import pandas as pd

string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [2]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [3]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

## 滤除缺少数据

In [4]:
from numpy import nan as NA

data = pd.Series([1, NA, 3.5, NA, 7])

In [5]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [6]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA], [NA, NA, NA], [NA, 6.5, 3.]])

In [7]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
data.dropna()

     0    1    2
0  1.0  6.5  3.0

In [9]:
data.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [10]:
data[4] = NA

In [11]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [12]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

## 填充缺失数据

fillna方法是最主要的函数。通过一个常数调用fillna就会将缺失值替换为那个常数值。

In [13]:
df = pd.DataFrame(np.random.randn(7, 3))

In [14]:
df

          0         1         2
0  0.134427  0.537574 -2.762990
1 -0.292179 -0.361857 -1.691360
2  0.223110 -1.386427  0.987943
3  0.005389  1.018230  0.682646
4  0.731797 -0.593719 -2.612307
5 -1.668142  0.551747  0.912295
6  1.399943  0.539490  0.935294

In [15]:
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

In [16]:
df

          0         1         2
0  0.134427       NaN       NaN
1 -0.292179       NaN       NaN
2  0.223110       NaN  0.987943
3  0.005389       NaN  0.682646
4  0.731797 -0.593719 -2.612307
5 -1.668142  0.551747  0.912295
6  1.399943  0.539490  0.935294

In [17]:
df.fillna(1000)

          0            1            2
0  0.134427  1000.000000  1000.000000
1 -0.292179  1000.000000  1000.000000
2  0.223110  1000.000000     0.987943
3  0.005389  1000.000000     0.682646
4  0.731797    -0.593719    -2.612307
5 -1.668142     0.551747     0.912295
6  1.399943     0.539490     0.935294

In [18]:
df.fillna({1:0.5, 2:3})

          0         1         2
0  0.134427  0.500000  3.000000
1 -0.292179  0.500000  3.000000
2  0.223110  0.500000  0.987943
3  0.005389  0.500000  0.682646
4  0.731797 -0.593719 -2.612307
5 -1.668142  0.551747  0.912295
6  1.399943  0.539490  0.935294

fillna默认会返回新对象，但也可以对现有对象进行就地修改。

In [19]:
df.fillna(0, inplace=True)

In [20]:
df

          0         1         2
0  0.134427  0.000000  0.000000
1 -0.292179  0.000000  0.000000
2  0.223110  0.000000  0.987943
3  0.005389  0.000000  0.682646
4  0.731797 -0.593719 -2.612307
5 -1.668142  0.551747  0.912295
6  1.399943  0.539490  0.935294

对重新索引有效的那些插值方法也可用于fillna。

In [21]:
df = pd.DataFrame(np.random.randn(6, 3))

df.iloc[2:, 1] = NA

df.iloc[4:, 2] = NA

In [22]:
df

          0         1         2
0 -1.507769  1.188499  0.175226
1  0.776225  1.540495 -0.058776
2 -0.116026       NaN -2.552589
3  0.292244       NaN  1.995295
4  1.167537       NaN       NaN
5  0.664193       NaN       NaN

In [23]:
df.fillna(method='ffill', limit=2)

          0         1         2
0 -1.507769  1.188499  0.175226
1  0.776225  1.540495 -0.058776
2 -0.116026  1.540495 -2.552589
3  0.292244  1.540495  1.995295
4  1.167537       NaN  1.995295
5  0.664193       NaN  1.995295

### 创新

In [24]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [25]:
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [26]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

# 数据转换

## 移除重复数据

DataFrame的duplicated方法返回一个布尔型Series，表示各行是否是重复行（前面出现过的行）。

还有一个与此相关的drop_duplicates方法，它会返回一个DataFrame，重复的数组会标为False。

In [27]:
data = pd.DataFrame({'k1': ['one', 'two'] * 3 + ['two'], 'k2': [1, 1, 2, 3, 3, 4, 4]})

In [28]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [29]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [30]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

这两个方法默认会判断全部列，你也可以指定部分列进行重复项判断。

duplicated和drop_duplicates默认保留的是第一个出现的值组合。

## 利用函数进行数据转换

In [31]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon', 
        'Pastrami', 'corned beef', 'Bacon', 'pastrami', 
        'honey ham', 'nova lox'], 'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

In [32]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [33]:
meat_to_animal = {
  'bacon': 'pig',
  'pulled pork': 'pig',
  'pastrami': 'cow',
  'corned beef': 'cow',
  'honey ham': 'pig',
  'nova lox': 'salmon'
}

In [34]:
meat_to_animal

{'bacon': 'pig',
 'pulled pork': 'pig',
 'pastrami': 'cow',
 'corned beef': 'cow',
 'honey ham': 'pig',
 'nova lox': 'salmon'}

In [35]:
data['animal'] = data['food'].map(lambda x: meat_to_animal[x.lower()])

In [36]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

## 替换值

利用fillna方法填充缺失数据可以看做值替换的一种特殊情况。前面已经看到，map可用于修改对象的数据子集，而replace则提供了一种实现该功能的更简单、更灵活的方式。

In [37]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [38]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [39]:
data.replace(-999.0, 999)

0       1.0
1     999.0
2       2.0
3     999.0
4   -1000.0
5       3.0
dtype: float64

## 重命名轴索引

跟Series中的值一样，轴标签也可以通过函数或映射进行转换，从而得到一个新的不同标签的对象。轴还可以被就地修改，而无需新建一个数据结构。

跟Series一样，轴索引也有一个map方法。

In [40]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), index=['Ohio', 'Colorado', 'New York'], columns=['one', 'two', 'three', 'four'])

In [41]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [42]:
transform = lambda x: x[:4].upper()

In [43]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

## 离散化和面元划分

为了便于分析，连续数据常常被离散化或拆分为“面元”（bin）。

比如将年龄划分为“18 到 25”、“26 到 35”、“35 到 60”以及“60 以上”几个面元。

In [44]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [45]:
bins = [18, 25, 35, 60, 100]

In [46]:
cats = pd.cut(ages, bins)

In [47]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

pandas 返回的是一个特殊的Categorical对象。结果展示了pandas.cut划分的面元。你可以将其看做一组表示面元名称的字符串。它的底层含有一个表示不同分类名称的类型数组，以及一个codes属性中的年龄数据的标签

In [48]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [49]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [50]:
cats.value_counts()

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
dtype: int64

qcut是一个非常类似于cut的函数，它可以根据样本分位数对数据进行面元划分。根据数据的分布情况，cut可能无法使各个面元中含有相同数量的数据点。而qcut由于使用的是样本分位数，因此可以得到大小基本相等的面元。

## 检查和过滤

## 排列和随机采样

利用numpy.random.permutation函数可以轻松实现对Series或DataFrame的列的排列工作（permuting，随机重排序）。通过需要排列的轴的长度调用permutation，可产生一个表示新顺序的整数数组。